[
    {
        "Date": "2022-03-13",
        "Event_Type": "Society",
        "Country_Involved": "Eritrea",
        "Description": "A Civil Society Representative from Eritrea engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-04-14",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Chief of Staff of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-10-06",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Prime Minister of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-05-28",
        "Event_Type": "Military",
        "Country_Involved": "Guinea",
        "Description": "The General of Guinea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-03",
        "Event_Type": "Political",
        "Country_Involved": "Djibouti",
        "Description": "The Foreign Minister of Djibouti met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-06-29",
        "Event_Type": "Health",
        "Country_Involved": "Namibia",
        "Description": "The WHO Representative of Namibia collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-04-13",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Military Advisor of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-08",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Defense Minister of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-21",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The General of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-01",
        "Event_Type": "Military",
        "Country_Involved": "Guinea",
        "Description": "The Defense Minister of Guinea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-09",
        "Event_Type": "Health",
        "Country_Involved": "Nigeria",
        "Description": "The Medical Experts of Nigeria collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2024-02-17",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Ambassador of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-23",
        "Event_Type": "Economic",
        "Country_Involved": "Senegal",
        "Description": "The Business Delegation of Senegal signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-09-27",
        "Event_Type": "Society",
        "Country_Involved": "Egypt",
        "Description": "A NGO Leader from Egypt engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-02-15",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Trade Minister of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-11-27",
        "Event_Type": "Health",
        "Country_Involved": "Somalia",
        "Description": "The Health Minister of Somalia collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-08-29",
        "Event_Type": "Health",
        "Country_Involved": "South Africa",
        "Description": "The Medical Experts of South Africa collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-04-11",
        "Event_Type": "Military",
        "Country_Involved": "Mali",
        "Description": "The General of Mali held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-14",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-02-14",
        "Event_Type": "Society",
        "Country_Involved": "Mauritania",
        "Description": "A NGO Leader from Mauritania engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-06-27",
        "Event_Type": "Economic",
        "Country_Involved": "Cameroon",
        "Description": "The Finance Minister of Cameroon signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-06-29",
        "Event_Type": "Military",
        "Country_Involved": "Guinea-Bissau",
        "Description": "The Chief of Staff of Guinea-Bissau held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-17",
        "Event_Type": "Society",
        "Country_Involved": "Ghana",
        "Description": "A Civil Society Representative from Ghana engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-02-03",
        "Event_Type": "Society",
        "Country_Involved": "Angola",
        "Description": "A Cultural Attaché from Angola engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-03-08",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Foreign Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-08-08",
        "Event_Type": "Economic",
        "Country_Involved": "Kenya",
        "Description": "The Business Delegation of Kenya signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-01-28",
        "Event_Type": "Military",
        "Country_Involved": "Congo",
        "Description": "The Chief of Staff of Congo held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-08-25",
        "Event_Type": "Political",
        "Country_Involved": "Nigeria",
        "Description": "The Foreign Minister of Nigeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-11-20",
        "Event_Type": "Economic",
        "Country_Involved": "Ethiopia",
        "Description": "The Business Delegation of Ethiopia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-08-13",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Ambassador of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-09-09",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Finance Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-09-26",
        "Event_Type": "Economic",
        "Country_Involved": "South Africa",
        "Description": "The Business Delegation of South Africa signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-06-10",
        "Event_Type": "Military",
        "Country_Involved": "South Sudan",
        "Description": "The Defense Minister of South Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-14",
        "Event_Type": "Society",
        "Country_Involved": "Burundi",
        "Description": "A Human Rights Activist from Burundi engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-01-12",
        "Event_Type": "Political",
        "Country_Involved": "Somalia",
        "Description": "The Foreign Minister of Somalia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-26",
        "Event_Type": "Military",
        "Country_Involved": "Chad",
        "Description": "The Defense Minister of Chad held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-12",
        "Event_Type": "Economic",
        "Country_Involved": "Sudan",
        "Description": "The Finance Minister of Sudan signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-10-07",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Business Delegation of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-22",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Chief of Staff of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-21",
        "Event_Type": "Economic",
        "Country_Involved": "Senegal",
        "Description": "The Business Delegation of Senegal signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-09-25",
        "Event_Type": "Political",
        "Country_Involved": "Mauritius",
        "Description": "The Foreign Minister of Mauritius met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-24",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The General of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-07-06",
        "Event_Type": "Health",
        "Country_Involved": "Cameroon",
        "Description": "The Health Advisor of Cameroon collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-02-28",
        "Event_Type": "Economic",
        "Country_Involved": "Congo",
        "Description": "The Finance Minister of Congo signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-11-04",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-07-01",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The President of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-29",
        "Event_Type": "Political",
        "Country_Involved": "Ivory Coast",
        "Description": "The Ambassador of Ivory Coast met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-10-24",
        "Event_Type": "Economic",
        "Country_Involved": "Democratic Republic of the Congo",
        "Description": "The Business Delegation of Democratic Republic of the Congo signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-02-23",
        "Event_Type": "Society",
        "Country_Involved": "Malawi",
        "Description": "A Civil Society Representative from Malawi engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-12-14",
        "Event_Type": "Military",
        "Country_Involved": "Namibia",
        "Description": "The Military Advisor of Namibia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-05",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Prime Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-02-14",
        "Event_Type": "Economic",
        "Country_Involved": "Cameroon",
        "Description": "The Economic Advisor of Cameroon signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-09-30",
        "Event_Type": "Political",
        "Country_Involved": "Chad",
        "Description": "The Foreign Minister of Chad met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-12-26",
        "Event_Type": "Political",
        "Country_Involved": "Algeria",
        "Description": "The Prime Minister of Algeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-01-11",
        "Event_Type": "Economic",
        "Country_Involved": "Benin",
        "Description": "The Trade Minister of Benin signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-03-11",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The President of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-26",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Ambassador of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-02-25",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Prime Minister of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-21",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Ambassador of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-08-21",
        "Event_Type": "Economic",
        "Country_Involved": "Morocco",
        "Description": "The Trade Minister of Morocco signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-11-04",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-05-14",
        "Event_Type": "Economic",
        "Country_Involved": "Mozambique",
        "Description": "The Business Delegation of Mozambique signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-12-10",
        "Event_Type": "Military",
        "Country_Involved": "Zimbabwe",
        "Description": "The Defense Minister of Zimbabwe held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-11-10",
        "Event_Type": "Political",
        "Country_Involved": "Nigeria",
        "Description": "The President of Nigeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-09-11",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-07-31",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Military Advisor of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-28",
        "Event_Type": "Political",
        "Country_Involved": "Cabo Verde",
        "Description": "The Prime Minister of Cabo Verde met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-11-06",
        "Event_Type": "Society",
        "Country_Involved": "Ghana",
        "Description": "A NGO Leader from Ghana engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-08-08",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The President of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-08-23",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Foreign Minister of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-03",
        "Event_Type": "Military",
        "Country_Involved": "Mauritania",
        "Description": "The General of Mauritania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-22",
        "Event_Type": "Society",
        "Country_Involved": "Lesotho",
        "Description": "A Civil Society Representative from Lesotho engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-02-24",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-27",
        "Event_Type": "Economic",
        "Country_Involved": "Ethiopia",
        "Description": "The Finance Minister of Ethiopia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-01-29",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-07-12",
        "Event_Type": "Military",
        "Country_Involved": "Djibouti",
        "Description": "The General of Djibouti held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-11",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Military Advisor of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-06",
        "Event_Type": "Military",
        "Country_Involved": "Mozambique",
        "Description": "The Military Advisor of Mozambique held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-17",
        "Event_Type": "Political",
        "Country_Involved": "Seychelles",
        "Description": "The Ambassador of Seychelles met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-11",
        "Event_Type": "Military",
        "Country_Involved": "South Sudan",
        "Description": "The General of South Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-02-15",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Prime Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-12",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-10-21",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Military Advisor of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-18",
        "Event_Type": "Military",
        "Country_Involved": "Nigeria",
        "Description": "The Military Advisor of Nigeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-08-20",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The General of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-03-04",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Defense Minister of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-31",
        "Event_Type": "Health",
        "Country_Involved": "South Africa",
        "Description": "The Health Minister of South Africa collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2024-03-07",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-18",
        "Event_Type": "Health",
        "Country_Involved": "Cabo Verde",
        "Description": "The Health Advisor of Cabo Verde collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-03-22",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Ambassador of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-02-22",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The General of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-05-18",
        "Event_Type": "Health",
        "Country_Involved": "Botswana",
        "Description": "The Health Advisor of Botswana collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-01-26",
        "Event_Type": "Political",
        "Country_Involved": "Rwanda",
        "Description": "The Foreign Minister of Rwanda met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-07-10",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-08-29",
        "Event_Type": "Society",
        "Country_Involved": "Tanzania",
        "Description": "A Cultural Attaché from Tanzania engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-03-20",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The General of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-05-18",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Business Delegation of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-06-26",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Economic Advisor of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-10-13",
        "Event_Type": "Political",
        "Country_Involved": "Guinea-Bissau",
        "Description": "The President of Guinea-Bissau met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-02-09",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Ambassador of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-08-22",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-14",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Chief of Staff of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-07-21",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Trade Minister of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-05-17",
        "Event_Type": "Health",
        "Country_Involved": "Nigeria",
        "Description": "The WHO Representative of Nigeria collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-10-13",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The General of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-20",
        "Event_Type": "Military",
        "Country_Involved": "Rwanda",
        "Description": "The General of Rwanda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-05-14",
        "Event_Type": "Military",
        "Country_Involved": "Kenya",
        "Description": "The General of Kenya held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-05-29",
        "Event_Type": "Military",
        "Country_Involved": "Nigeria",
        "Description": "The Chief of Staff of Nigeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-29",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Chief of Staff of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-05-30",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Prime Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-05",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-09-11",
        "Event_Type": "Political",
        "Country_Involved": "Uganda",
        "Description": "The Foreign Minister of Uganda met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-08-09",
        "Event_Type": "Economic",
        "Country_Involved": "Senegal",
        "Description": "The Trade Minister of Senegal signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-08-14",
        "Event_Type": "Economic",
        "Country_Involved": "Cabo Verde",
        "Description": "The Finance Minister of Cabo Verde signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-02-20",
        "Event_Type": "Military",
        "Country_Involved": "Eritrea",
        "Description": "The Military Advisor of Eritrea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-15",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The General of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-20",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Finance Minister of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-04-30",
        "Event_Type": "Political",
        "Country_Involved": "Uganda",
        "Description": "The President of Uganda met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-30",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Chief of Staff of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-06-12",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-24",
        "Event_Type": "Military",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The General of Sao Tome and Principe held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-05-21",
        "Event_Type": "Health",
        "Country_Involved": "Nigeria",
        "Description": "The Health Advisor of Nigeria collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-05-08",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Military Advisor of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-30",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Business Delegation of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-02-11",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Ambassador of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-27",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The President of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-09",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Defense Minister of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-11",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Foreign Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-25",
        "Event_Type": "Economic",
        "Country_Involved": "Ghana",
        "Description": "The Business Delegation of Ghana signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-05-27",
        "Event_Type": "Military",
        "Country_Involved": "Nigeria",
        "Description": "The General of Nigeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-07-02",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Defense Minister of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-29",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Chief of Staff of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-05-07",
        "Event_Type": "Military",
        "Country_Involved": "Mauritius",
        "Description": "The Defense Minister of Mauritius held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-07-29",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Foreign Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-06-24",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Defense Minister of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-23",
        "Event_Type": "Society",
        "Country_Involved": "Ghana",
        "Description": "A Human Rights Activist from Ghana engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-03-25",
        "Event_Type": "Military",
        "Country_Involved": "Malawi",
        "Description": "The Military Advisor of Malawi held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-06-14",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The President of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-06",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-09-28",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Military Advisor of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-25",
        "Event_Type": "Political",
        "Country_Involved": "Libya",
        "Description": "The Prime Minister of Libya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-07-17",
        "Event_Type": "Economic",
        "Country_Involved": "Kenya",
        "Description": "The Finance Minister of Kenya signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-07-01",
        "Event_Type": "Economic",
        "Country_Involved": "Niger",
        "Description": "The Business Delegation of Niger signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-10-29",
        "Event_Type": "Military",
        "Country_Involved": "Somalia",
        "Description": "The General of Somalia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-04-11",
        "Event_Type": "Economic",
        "Country_Involved": "Tanzania",
        "Description": "The Finance Minister of Tanzania signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-01-09",
        "Event_Type": "Political",
        "Country_Involved": "Comoros",
        "Description": "The Ambassador of Comoros met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-05-02",
        "Event_Type": "Society",
        "Country_Involved": "Guinea-Bissau",
        "Description": "A Civil Society Representative from Guinea-Bissau engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-11-07",
        "Event_Type": "Society",
        "Country_Involved": "Zambia",
        "Description": "A Civil Society Representative from Zambia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-07-16",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Military Advisor of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-07-26",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The General of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-05-03",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Chief of Staff of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-10-25",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The President of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-02-22",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The Ambassador of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-05-09",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-26",
        "Event_Type": "Military",
        "Country_Involved": "Equatorial Guinea",
        "Description": "The Military Advisor of Equatorial Guinea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-11",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-06-27",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-01-25",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-21",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Business Delegation of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-26",
        "Event_Type": "Political",
        "Country_Involved": "Uganda",
        "Description": "The Ambassador of Uganda met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-07",
        "Event_Type": "Economic",
        "Country_Involved": "Cameroon",
        "Description": "The Trade Minister of Cameroon signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-07-30",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-21",
        "Event_Type": "Military",
        "Country_Involved": "Rwanda",
        "Description": "The Defense Minister of Rwanda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-04-11",
        "Event_Type": "Political",
        "Country_Involved": "Nigeria",
        "Description": "The Ambassador of Nigeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-22",
        "Event_Type": "Political",
        "Country_Involved": "Ivory Coast",
        "Description": "The President of Ivory Coast met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-26",
        "Event_Type": "Health",
        "Country_Involved": "Botswana",
        "Description": "The WHO Representative of Botswana collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-09-20",
        "Event_Type": "Political",
        "Country_Involved": "Guinea",
        "Description": "The Foreign Minister of Guinea met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-06-10",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-04-22",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Military Advisor of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-07",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-24",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-04",
        "Event_Type": "Economic",
        "Country_Involved": "Mauritania",
        "Description": "The Economic Advisor of Mauritania signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-06-24",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Finance Minister of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-07-27",
        "Event_Type": "Military",
        "Country_Involved": "Sudan",
        "Description": "The General of Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-02-22",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Trade Minister of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-09-13",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-21",
        "Event_Type": "Military",
        "Country_Involved": "Democratic Republic of the Congo",
        "Description": "The Military Advisor of Democratic Republic of the Congo held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-22",
        "Event_Type": "Military",
        "Country_Involved": "Mozambique",
        "Description": "The Military Advisor of Mozambique held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-06-04",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Defense Minister of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-11-17",
        "Event_Type": "Society",
        "Country_Involved": "Uganda",
        "Description": "A NGO Leader from Uganda engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-10-08",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Chief of Staff of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-11-12",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Business Delegation of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-13",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The President of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-31",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Military Advisor of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-13",
        "Event_Type": "Military",
        "Country_Involved": "Kenya",
        "Description": "The Chief of Staff of Kenya held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-08-17",
        "Event_Type": "Political",
        "Country_Involved": "Gabon",
        "Description": "The Ambassador of Gabon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-03-07",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The President of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-28",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Defense Minister of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-02-11",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-03-04",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Economic Advisor of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-02-14",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Chief of Staff of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-17",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-25",
        "Event_Type": "Political",
        "Country_Involved": "Guinea",
        "Description": "The Ambassador of Guinea met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-05",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Chief of Staff of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-03-07",
        "Event_Type": "Military",
        "Country_Involved": "Benin",
        "Description": "The Military Advisor of Benin held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-18",
        "Event_Type": "Political",
        "Country_Involved": "Algeria",
        "Description": "The President of Algeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-11",
        "Event_Type": "Economic",
        "Country_Involved": "Ethiopia",
        "Description": "The Business Delegation of Ethiopia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-07-25",
        "Event_Type": "Military",
        "Country_Involved": "Burkina Faso",
        "Description": "The Military Advisor of Burkina Faso held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-08-03",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Chief of Staff of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-24",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-10-17",
        "Event_Type": "Health",
        "Country_Involved": "Nigeria",
        "Description": "The WHO Representative of Nigeria collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-09-28",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Prime Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-02-01",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Prime Minister of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-28",
        "Event_Type": "Political",
        "Country_Involved": "Sierra Leone",
        "Description": "The Foreign Minister of Sierra Leone met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-15",
        "Event_Type": "Society",
        "Country_Involved": "Eritrea",
        "Description": "A NGO Leader from Eritrea engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-01-20",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Defense Minister of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-09-08",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-01-17",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-04-20",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The President of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-06-29",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-03-23",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The Foreign Minister of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-07-14",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Defense Minister of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-09",
        "Event_Type": "Society",
        "Country_Involved": "Sudan",
        "Description": "A Cultural Attaché from Sudan engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-01-14",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-09-22",
        "Event_Type": "Military",
        "Country_Involved": "Libya",
        "Description": "The General of Libya held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-27",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Chief of Staff of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-29",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The General of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-03-30",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-30",
        "Event_Type": "Health",
        "Country_Involved": "Nigeria",
        "Description": "The WHO Representative of Nigeria collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-11-08",
        "Event_Type": "Military",
        "Country_Involved": "Burkina Faso",
        "Description": "The Military Advisor of Burkina Faso held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-29",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Defense Minister of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-07-11",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Ambassador of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-23",
        "Event_Type": "Political",
        "Country_Involved": "Namibia",
        "Description": "The Foreign Minister of Namibia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-09",
        "Event_Type": "Military",
        "Country_Involved": "Gabon",
        "Description": "The General of Gabon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-04",
        "Event_Type": "Health",
        "Country_Involved": "Ethiopia",
        "Description": "The Health Minister of Ethiopia collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-12-29",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-04-10",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Trade Minister of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-08-02",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Chief of Staff of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-25",
        "Event_Type": "Health",
        "Country_Involved": "Senegal",
        "Description": "The Health Minister of Senegal collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-12-10",
        "Event_Type": "Military",
        "Country_Involved": "Niger",
        "Description": "The Defense Minister of Niger held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-07-10",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The General of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-07-29",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The General of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-03-10",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Ambassador of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-27",
        "Event_Type": "Military",
        "Country_Involved": "Congo",
        "Description": "The General of Congo held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-10-01",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The President of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-11-27",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-02",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Economic Advisor of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-10-12",
        "Event_Type": "Political",
        "Country_Involved": "Malawi",
        "Description": "The President of Malawi met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-10-14",
        "Event_Type": "Political",
        "Country_Involved": "Mauritania",
        "Description": "The Ambassador of Mauritania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-01-04",
        "Event_Type": "Economic",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The Business Delegation of Sao Tome and Principe signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-09",
        "Event_Type": "Society",
        "Country_Involved": "Algeria",
        "Description": "A Cultural Attaché from Algeria engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-02-01",
        "Event_Type": "Military",
        "Country_Involved": "Malawi",
        "Description": "The General of Malawi held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-07-26",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Military Advisor of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-31",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Defense Minister of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-06",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Foreign Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-11",
        "Event_Type": "Military",
        "Country_Involved": "Libya",
        "Description": "The Chief of Staff of Libya held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-07-15",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-07-04",
        "Event_Type": "Economic",
        "Country_Involved": "Morocco",
        "Description": "The Finance Minister of Morocco signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-30",
        "Event_Type": "Economic",
        "Country_Involved": "Congo",
        "Description": "The Business Delegation of Congo signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-04-19",
        "Event_Type": "Military",
        "Country_Involved": "South Sudan",
        "Description": "The Chief of Staff of South Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-05-09",
        "Event_Type": "Political",
        "Country_Involved": "Gambia",
        "Description": "The Ambassador of Gambia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-04-04",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Foreign Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-11-30",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Defense Minister of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-01-11",
        "Event_Type": "Economic",
        "Country_Involved": "Zambia",
        "Description": "The Business Delegation of Zambia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-07-15",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The General of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-02",
        "Event_Type": "Political",
        "Country_Involved": "Djibouti",
        "Description": "The Prime Minister of Djibouti met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-20",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Defense Minister of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-16",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Foreign Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-03",
        "Event_Type": "Political",
        "Country_Involved": "Gabon",
        "Description": "The Foreign Minister of Gabon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-04-23",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-10",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-21",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Defense Minister of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-06-25",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-05-04",
        "Event_Type": "Society",
        "Country_Involved": "Morocco",
        "Description": "A Human Rights Activist from Morocco engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-10-29",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-11-19",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Military Advisor of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-12-16",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Defense Minister of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-10",
        "Event_Type": "Political",
        "Country_Involved": "Zambia",
        "Description": "The President of Zambia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-05",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Chief of Staff of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-07-21",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Foreign Minister of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-28",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Prime Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-09-28",
        "Event_Type": "Society",
        "Country_Involved": "Eswatini",
        "Description": "A Civil Society Representative from Eswatini engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-06-22",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-08-15",
        "Event_Type": "Society",
        "Country_Involved": "Seychelles",
        "Description": "A Civil Society Representative from Seychelles engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-03-18",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Chief of Staff of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-06",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Business Delegation of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-10-11",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Chief of Staff of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-03-06",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Defense Minister of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-02-08",
        "Event_Type": "Economic",
        "Country_Involved": "South Africa",
        "Description": "The Trade Minister of South Africa signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-02-19",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Finance Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-27",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Prime Minister of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-14",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Foreign Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-24",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The General of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-06-17",
        "Event_Type": "Political",
        "Country_Involved": "Sudan",
        "Description": "The President of Sudan met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-09-23",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-09-11",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-08-19",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Defense Minister of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-12",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Finance Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-24",
        "Event_Type": "Military",
        "Country_Involved": "Mozambique",
        "Description": "The Military Advisor of Mozambique held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-01",
        "Event_Type": "Political",
        "Country_Involved": "Eswatini",
        "Description": "The President of Eswatini met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-04-07",
        "Event_Type": "Economic",
        "Country_Involved": "Guinea-Bissau",
        "Description": "The Business Delegation of Guinea-Bissau signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-19",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The President of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-02-07",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The President of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-11-24",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Prime Minister of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-06-05",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The President of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-04",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-05-05",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Military Advisor of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-28",
        "Event_Type": "Society",
        "Country_Involved": "Ethiopia",
        "Description": "A Human Rights Activist from Ethiopia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-08-25",
        "Event_Type": "Society",
        "Country_Involved": "Zambia",
        "Description": "A Civil Society Representative from Zambia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-07-13",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The President of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-15",
        "Event_Type": "Economic",
        "Country_Involved": "Mali",
        "Description": "The Business Delegation of Mali signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-01-25",
        "Event_Type": "Political",
        "Country_Involved": "Senegal",
        "Description": "The Foreign Minister of Senegal met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-12-07",
        "Event_Type": "Military",
        "Country_Involved": "Eritrea",
        "Description": "The Chief of Staff of Eritrea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-07-07",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-22",
        "Event_Type": "Health",
        "Country_Involved": "Senegal",
        "Description": "The Health Minister of Senegal collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-05-29",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The General of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-07-10",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-06-20",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-12-03",
        "Event_Type": "Military",
        "Country_Involved": "Botswana",
        "Description": "The General of Botswana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-10",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-20",
        "Event_Type": "Military",
        "Country_Involved": "Kenya",
        "Description": "The Chief of Staff of Kenya held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-06-30",
        "Event_Type": "Society",
        "Country_Involved": "Algeria",
        "Description": "A Civil Society Representative from Algeria engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-09-03",
        "Event_Type": "Society",
        "Country_Involved": "Senegal",
        "Description": "A Human Rights Activist from Senegal engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-03-19",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Trade Minister of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-10",
        "Event_Type": "Political",
        "Country_Involved": "Somalia",
        "Description": "The Prime Minister of Somalia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-08-08",
        "Event_Type": "Health",
        "Country_Involved": "Burundi",
        "Description": "The Health Minister of Burundi collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-02-28",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-12-09",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The General of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-17",
        "Event_Type": "Economic",
        "Country_Involved": "Senegal",
        "Description": "The Finance Minister of Senegal signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-11-18",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The Foreign Minister of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-09-01",
        "Event_Type": "Health",
        "Country_Involved": "Botswana",
        "Description": "The Health Advisor of Botswana collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-09-17",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The General of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-10-09",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-08-18",
        "Event_Type": "Economic",
        "Country_Involved": "Cameroon",
        "Description": "The Economic Advisor of Cameroon signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-12-19",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Military Advisor of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-06-29",
        "Event_Type": "Political",
        "Country_Involved": "Senegal",
        "Description": "The Foreign Minister of Senegal met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-04",
        "Event_Type": "Economic",
        "Country_Involved": "Comoros",
        "Description": "The Trade Minister of Comoros signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-12-10",
        "Event_Type": "Political",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The Foreign Minister of Sao Tome and Principe met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-04-20",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-07",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Foreign Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-05",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-03-30",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Chief of Staff of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-10",
        "Event_Type": "Health",
        "Country_Involved": "Niger",
        "Description": "The Medical Experts of Niger collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-05-19",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Prime Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-04-13",
        "Event_Type": "Political",
        "Country_Involved": "Liberia",
        "Description": "The Prime Minister of Liberia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-31",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Ambassador of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-12-21",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Foreign Minister of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-08-04",
        "Event_Type": "Health",
        "Country_Involved": "Kenya",
        "Description": "The Health Advisor of Kenya collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-03-19",
        "Event_Type": "Military",
        "Country_Involved": "Burkina Faso",
        "Description": "The Defense Minister of Burkina Faso held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-01-31",
        "Event_Type": "Political",
        "Country_Involved": "Gambia",
        "Description": "The Prime Minister of Gambia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-02-16",
        "Event_Type": "Health",
        "Country_Involved": "Cameroon",
        "Description": "The Health Advisor of Cameroon collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-03-11",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The Prime Minister of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-06-30",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The Prime Minister of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-03-05",
        "Event_Type": "Society",
        "Country_Involved": "Kenya",
        "Description": "A NGO Leader from Kenya engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-07-28",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Defense Minister of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-21",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-06",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Defense Minister of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-10",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The Ambassador of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-08-19",
        "Event_Type": "Military",
        "Country_Involved": "Gambia",
        "Description": "The Chief of Staff of Gambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-08-10",
        "Event_Type": "Political",
        "Country_Involved": "Senegal",
        "Description": "The Ambassador of Senegal met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-07-27",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Economic Advisor of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-01-26",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Prime Minister of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-19",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Defense Minister of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-02-07",
        "Event_Type": "Society",
        "Country_Involved": "Kenya",
        "Description": "A NGO Leader from Kenya engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-01-23",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-12-30",
        "Event_Type": "Political",
        "Country_Involved": "South Sudan",
        "Description": "The Prime Minister of South Sudan met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-12-03",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The Ambassador of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-25",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The President of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-03",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Economic Advisor of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-03-15",
        "Event_Type": "Health",
        "Country_Involved": "Democratic Republic of the Congo",
        "Description": "The Health Minister of Democratic Republic of the Congo collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-11-14",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The President of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-06-18",
        "Event_Type": "Society",
        "Country_Involved": "Ethiopia",
        "Description": "A NGO Leader from Ethiopia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-08-08",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-01-04",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Chief of Staff of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-11-28",
        "Event_Type": "Society",
        "Country_Involved": "Madagascar",
        "Description": "A Human Rights Activist from Madagascar engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-04-01",
        "Event_Type": "Health",
        "Country_Involved": "Angola",
        "Description": "The Medical Experts of Angola collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-01-11",
        "Event_Type": "Society",
        "Country_Involved": "Comoros",
        "Description": "A Cultural Attaché from Comoros engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-07-12",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-10-14",
        "Event_Type": "Military",
        "Country_Involved": "Mali",
        "Description": "The General of Mali held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-08-30",
        "Event_Type": "Military",
        "Country_Involved": "Ivory Coast",
        "Description": "The Military Advisor of Ivory Coast held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-02-24",
        "Event_Type": "Political",
        "Country_Involved": "Uganda",
        "Description": "The Prime Minister of Uganda met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-05-28",
        "Event_Type": "Political",
        "Country_Involved": "Zambia",
        "Description": "The Prime Minister of Zambia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-08-07",
        "Event_Type": "Society",
        "Country_Involved": "Malawi",
        "Description": "A NGO Leader from Malawi engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-08-24",
        "Event_Type": "Political",
        "Country_Involved": "Mauritania",
        "Description": "The Foreign Minister of Mauritania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-02-18",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The President of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-12-09",
        "Event_Type": "Military",
        "Country_Involved": "Ivory Coast",
        "Description": "The General of Ivory Coast held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-29",
        "Event_Type": "Political",
        "Country_Involved": "Eritrea",
        "Description": "The Prime Minister of Eritrea met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-11",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Chief of Staff of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-05-19",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Prime Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-07-08",
        "Event_Type": "Political",
        "Country_Involved": "Madagascar",
        "Description": "The Prime Minister of Madagascar met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-05-02",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-09-03",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Ambassador of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-19",
        "Event_Type": "Society",
        "Country_Involved": "South Africa",
        "Description": "A Cultural Attaché from South Africa engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-01-09",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-26",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-11-25",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Military Advisor of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-06-26",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-02-19",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-04-11",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-01-21",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-08-19",
        "Event_Type": "Society",
        "Country_Involved": "Togo",
        "Description": "A Civil Society Representative from Togo engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-09-14",
        "Event_Type": "Political",
        "Country_Involved": "Algeria",
        "Description": "The Prime Minister of Algeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-26",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Economic Advisor of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-08-02",
        "Event_Type": "Society",
        "Country_Involved": "Uganda",
        "Description": "A Cultural Attaché from Uganda engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-01-08",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Military Advisor of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-21",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Chief of Staff of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-15",
        "Event_Type": "Military",
        "Country_Involved": "Burundi",
        "Description": "The Military Advisor of Burundi held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-12-07",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-14",
        "Event_Type": "Health",
        "Country_Involved": "South Africa",
        "Description": "The Health Minister of South Africa collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2024-08-17",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Military Advisor of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-10-28",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The President of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-02",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Military Advisor of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-11-19",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Defense Minister of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-01-29",
        "Event_Type": "Military",
        "Country_Involved": "Sierra Leone",
        "Description": "The General of Sierra Leone held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-29",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Defense Minister of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-19",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Chief of Staff of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-12-22",
        "Event_Type": "Society",
        "Country_Involved": "Senegal",
        "Description": "A Human Rights Activist from Senegal engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-10-03",
        "Event_Type": "Economic",
        "Country_Involved": "Zambia",
        "Description": "The Finance Minister of Zambia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-10",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The Ambassador of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-05-02",
        "Event_Type": "Society",
        "Country_Involved": "Algeria",
        "Description": "A NGO Leader from Algeria engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-01-17",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-01-11",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The Prime Minister of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-06-15",
        "Event_Type": "Political",
        "Country_Involved": "Mozambique",
        "Description": "The Prime Minister of Mozambique met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-11",
        "Event_Type": "Political",
        "Country_Involved": "South Africa",
        "Description": "The President of South Africa met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-02-28",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-07-04",
        "Event_Type": "Military",
        "Country_Involved": "Mauritania",
        "Description": "The Military Advisor of Mauritania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-10-06",
        "Event_Type": "Economic",
        "Country_Involved": "Tunisia",
        "Description": "The Economic Advisor of Tunisia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-18",
        "Event_Type": "Political",
        "Country_Involved": "Congo",
        "Description": "The Foreign Minister of Congo met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-14",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Chief of Staff of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-11",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Prime Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-05-30",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-08-24",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Military Advisor of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-03-27",
        "Event_Type": "Political",
        "Country_Involved": "Somalia",
        "Description": "The Prime Minister of Somalia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-05-30",
        "Event_Type": "Economic",
        "Country_Involved": "South Africa",
        "Description": "The Trade Minister of South Africa signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-16",
        "Event_Type": "Economic",
        "Country_Involved": "Guinea-Bissau",
        "Description": "The Business Delegation of Guinea-Bissau signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-11-19",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Defense Minister of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-05",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Business Delegation of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-01",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-06-17",
        "Event_Type": "Military",
        "Country_Involved": "Comoros",
        "Description": "The Defense Minister of Comoros held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-06-09",
        "Event_Type": "Society",
        "Country_Involved": "Senegal",
        "Description": "A Cultural Attaché from Senegal engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-12-03",
        "Event_Type": "Economic",
        "Country_Involved": "Ghana",
        "Description": "The Finance Minister of Ghana signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-11-20",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The President of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-16",
        "Event_Type": "Economic",
        "Country_Involved": "Malawi",
        "Description": "The Trade Minister of Malawi signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-03-01",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The Defense Minister of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-08-29",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Foreign Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-12-23",
        "Event_Type": "Political",
        "Country_Involved": "Djibouti",
        "Description": "The Prime Minister of Djibouti met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-09-08",
        "Event_Type": "Political",
        "Country_Involved": "Niger",
        "Description": "The President of Niger met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-01-02",
        "Event_Type": "Economic",
        "Country_Involved": "Equatorial Guinea",
        "Description": "The Finance Minister of Equatorial Guinea signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-20",
        "Event_Type": "Economic",
        "Country_Involved": "Gambia",
        "Description": "The Finance Minister of Gambia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-02-23",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-11-24",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Defense Minister of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-03-16",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Trade Minister of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-07",
        "Event_Type": "Society",
        "Country_Involved": "Nigeria",
        "Description": "A Human Rights Activist from Nigeria engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-08-22",
        "Event_Type": "Economic",
        "Country_Involved": "Benin",
        "Description": "The Trade Minister of Benin signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-04-09",
        "Event_Type": "Economic",
        "Country_Involved": "Kenya",
        "Description": "The Finance Minister of Kenya signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-01-10",
        "Event_Type": "Political",
        "Country_Involved": "Kenya",
        "Description": "The President of Kenya met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-01-17",
        "Event_Type": "Political",
        "Country_Involved": "Tanzania",
        "Description": "The Prime Minister of Tanzania met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-09-30",
        "Event_Type": "Military",
        "Country_Involved": "Nigeria",
        "Description": "The Chief of Staff of Nigeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-27",
        "Event_Type": "Economic",
        "Country_Involved": "Djibouti",
        "Description": "The Economic Advisor of Djibouti signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-11-24",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Defense Minister of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-25",
        "Event_Type": "Political",
        "Country_Involved": "Algeria",
        "Description": "The Ambassador of Algeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-09-10",
        "Event_Type": "Military",
        "Country_Involved": "South Sudan",
        "Description": "The Defense Minister of South Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-04-03",
        "Event_Type": "Society",
        "Country_Involved": "Tanzania",
        "Description": "A Cultural Attaché from Tanzania engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-05-01",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Foreign Minister of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-04-30",
        "Event_Type": "Military",
        "Country_Involved": "Seychelles",
        "Description": "The General of Seychelles held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-29",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Foreign Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-08-09",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Chief of Staff of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-16",
        "Event_Type": "Political",
        "Country_Involved": "Madagascar",
        "Description": "The Foreign Minister of Madagascar met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-15",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Ambassador of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-11",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-09-29",
        "Event_Type": "Military",
        "Country_Involved": "Ethiopia",
        "Description": "The Chief of Staff of Ethiopia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-08-09",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-05-04",
        "Event_Type": "Society",
        "Country_Involved": "Sierra Leone",
        "Description": "A NGO Leader from Sierra Leone engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-11-08",
        "Event_Type": "Political",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The President of Sao Tome and Principe met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-31",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Military Advisor of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-03-23",
        "Event_Type": "Health",
        "Country_Involved": "Namibia",
        "Description": "The Medical Experts of Namibia collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2024-01-09",
        "Event_Type": "Society",
        "Country_Involved": "Algeria",
        "Description": "A Cultural Attaché from Algeria engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-05-24",
        "Event_Type": "Military",
        "Country_Involved": "Tunisia",
        "Description": "The General of Tunisia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-05-02",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Foreign Minister of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-11-10",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Defense Minister of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-25",
        "Event_Type": "Economic",
        "Country_Involved": "Seychelles",
        "Description": "The Economic Advisor of Seychelles signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-06-09",
        "Event_Type": "Political",
        "Country_Involved": "Senegal",
        "Description": "The Foreign Minister of Senegal met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-08-17",
        "Event_Type": "Health",
        "Country_Involved": "Tanzania",
        "Description": "The Health Minister of Tanzania collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-04-02",
        "Event_Type": "Economic",
        "Country_Involved": "Gabon",
        "Description": "The Trade Minister of Gabon signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-09-11",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Foreign Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-06-25",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Ambassador of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-01-31",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Military Advisor of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-08-22",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Defense Minister of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-10-15",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Chief of Staff of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-03-23",
        "Event_Type": "Health",
        "Country_Involved": "Uganda",
        "Description": "The WHO Representative of Uganda collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-03-10",
        "Event_Type": "Political",
        "Country_Involved": "Guinea",
        "Description": "The Prime Minister of Guinea met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-07-23",
        "Event_Type": "Society",
        "Country_Involved": "Namibia",
        "Description": "A Human Rights Activist from Namibia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-02-19",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Finance Minister of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-24",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-24",
        "Event_Type": "Political",
        "Country_Involved": "Congo",
        "Description": "The Prime Minister of Congo met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-03-18",
        "Event_Type": "Military",
        "Country_Involved": "Eritrea",
        "Description": "The Military Advisor of Eritrea held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-04-23",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-05-04",
        "Event_Type": "Military",
        "Country_Involved": "Mauritania",
        "Description": "The General of Mauritania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-31",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-03-01",
        "Event_Type": "Society",
        "Country_Involved": "Central African Republic",
        "Description": "A Civil Society Representative from Central African Republic engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-06-15",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-08-25",
        "Event_Type": "Economic",
        "Country_Involved": "Chad",
        "Description": "The Economic Advisor of Chad signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-10-10",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Foreign Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-04-21",
        "Event_Type": "Economic",
        "Country_Involved": "Angola",
        "Description": "The Business Delegation of Angola signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-07-25",
        "Event_Type": "Economic",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The Economic Advisor of Sao Tome and Principe signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-10-27",
        "Event_Type": "Military",
        "Country_Involved": "South Sudan",
        "Description": "The Chief of Staff of South Sudan held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-04-14",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Ambassador of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-03-30",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-21",
        "Event_Type": "Political",
        "Country_Involved": "Guinea",
        "Description": "The Prime Minister of Guinea met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-24",
        "Event_Type": "Health",
        "Country_Involved": "Mozambique",
        "Description": "The WHO Representative of Mozambique collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2024-03-12",
        "Event_Type": "Economic",
        "Country_Involved": "South Africa",
        "Description": "The Business Delegation of South Africa signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-07-23",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Foreign Minister of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-02-18",
        "Event_Type": "Health",
        "Country_Involved": "Cameroon",
        "Description": "The WHO Representative of Cameroon collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2021-04-08",
        "Event_Type": "Economic",
        "Country_Involved": "Morocco",
        "Description": "The Economic Advisor of Morocco signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-06-23",
        "Event_Type": "Military",
        "Country_Involved": "Gambia",
        "Description": "The Chief of Staff of Gambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-04-23",
        "Event_Type": "Economic",
        "Country_Involved": "Libya",
        "Description": "The Economic Advisor of Libya signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-08-29",
        "Event_Type": "Society",
        "Country_Involved": "Zambia",
        "Description": "A Human Rights Activist from Zambia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-10-11",
        "Event_Type": "Economic",
        "Country_Involved": "Uganda",
        "Description": "The Business Delegation of Uganda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-06-26",
        "Event_Type": "Political",
        "Country_Involved": "Nigeria",
        "Description": "The Prime Minister of Nigeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-01-30",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Defense Minister of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-08-18",
        "Event_Type": "Society",
        "Country_Involved": "Mauritania",
        "Description": "A NGO Leader from Mauritania engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-01-08",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Prime Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-08",
        "Event_Type": "Economic",
        "Country_Involved": "Somalia",
        "Description": "The Finance Minister of Somalia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-06",
        "Event_Type": "Political",
        "Country_Involved": "Algeria",
        "Description": "The Foreign Minister of Algeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-12-23",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Prime Minister of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-08-04",
        "Event_Type": "Society",
        "Country_Involved": "Guinea",
        "Description": "A Civil Society Representative from Guinea engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-08-08",
        "Event_Type": "Political",
        "Country_Involved": "Ghana",
        "Description": "The President of Ghana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-06-13",
        "Event_Type": "Political",
        "Country_Involved": "Niger",
        "Description": "The Ambassador of Niger met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-04-17",
        "Event_Type": "Economic",
        "Country_Involved": "Egypt",
        "Description": "The Trade Minister of Egypt signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-08-23",
        "Event_Type": "Political",
        "Country_Involved": "Nigeria",
        "Description": "The Prime Minister of Nigeria met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-06-09",
        "Event_Type": "Military",
        "Country_Involved": "Niger",
        "Description": "The Military Advisor of Niger held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-07",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Defense Minister of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-04-04",
        "Event_Type": "Military",
        "Country_Involved": "Burkina Faso",
        "Description": "The Defense Minister of Burkina Faso held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-10-25",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Defense Minister of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-02-03",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Chief of Staff of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-24",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Chief of Staff of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-26",
        "Event_Type": "Military",
        "Country_Involved": "Tanzania",
        "Description": "The General of Tanzania held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-09-18",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-09-15",
        "Event_Type": "Military",
        "Country_Involved": "Algeria",
        "Description": "The Chief of Staff of Algeria held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-12-05",
        "Event_Type": "Military",
        "Country_Involved": "Seychelles",
        "Description": "The Chief of Staff of Seychelles held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-27",
        "Event_Type": "Political",
        "Country_Involved": "Angola",
        "Description": "The Prime Minister of Angola met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-01-04",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Military Advisor of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-20",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Chief of Staff of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-12-05",
        "Event_Type": "Society",
        "Country_Involved": "Angola",
        "Description": "A Human Rights Activist from Angola engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-05-03",
        "Event_Type": "Military",
        "Country_Involved": "Central African Republic",
        "Description": "The General of Central African Republic held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-27",
        "Event_Type": "Economic",
        "Country_Involved": "Gambia",
        "Description": "The Economic Advisor of Gambia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-11-27",
        "Event_Type": "Society",
        "Country_Involved": "Burundi",
        "Description": "A NGO Leader from Burundi engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-10-31",
        "Event_Type": "Political",
        "Country_Involved": "Botswana",
        "Description": "The President of Botswana met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-03-09",
        "Event_Type": "Military",
        "Country_Involved": "Angola",
        "Description": "The Military Advisor of Angola held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-11-01",
        "Event_Type": "Military",
        "Country_Involved": "Senegal",
        "Description": "The Chief of Staff of Senegal held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-01-07",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Economic Advisor of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-07-03",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-04-23",
        "Event_Type": "Economic",
        "Country_Involved": "Sudan",
        "Description": "The Finance Minister of Sudan signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-12-13",
        "Event_Type": "Society",
        "Country_Involved": "Ethiopia",
        "Description": "A Human Rights Activist from Ethiopia engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2024-06-09",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-04-18",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Prime Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-04-15",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-11-29",
        "Event_Type": "Political",
        "Country_Involved": "Chad",
        "Description": "The Foreign Minister of Chad met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-11-12",
        "Event_Type": "Political",
        "Country_Involved": "Sudan",
        "Description": "The Prime Minister of Sudan met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-10-12",
        "Event_Type": "Military",
        "Country_Involved": "Cabo Verde",
        "Description": "The Defense Minister of Cabo Verde held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-19",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The General of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-07-09",
        "Event_Type": "Political",
        "Country_Involved": "Cameroon",
        "Description": "The Ambassador of Cameroon met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-03-29",
        "Event_Type": "Military",
        "Country_Involved": "South Africa",
        "Description": "The Military Advisor of South Africa held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-01-09",
        "Event_Type": "Military",
        "Country_Involved": "Cabo Verde",
        "Description": "The Military Advisor of Cabo Verde held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-16",
        "Event_Type": "Military",
        "Country_Involved": "Lesotho",
        "Description": "The Military Advisor of Lesotho held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-08-06",
        "Event_Type": "Health",
        "Country_Involved": "Senegal",
        "Description": "The WHO Representative of Senegal collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-08-02",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Ambassador of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2024-04-14",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Military Advisor of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-03-05",
        "Event_Type": "Society",
        "Country_Involved": "Comoros",
        "Description": "A Civil Society Representative from Comoros engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-06-18",
        "Event_Type": "Health",
        "Country_Involved": "Angola",
        "Description": "The Health Minister of Angola collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2023-02-24",
        "Event_Type": "Economic",
        "Country_Involved": "Algeria",
        "Description": "The Economic Advisor of Algeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-02-09",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The Foreign Minister of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-07-24",
        "Event_Type": "Economic",
        "Country_Involved": "Rwanda",
        "Description": "The Business Delegation of Rwanda signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-07-23",
        "Event_Type": "Economic",
        "Country_Involved": "Ethiopia",
        "Description": "The Finance Minister of Ethiopia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-12-18",
        "Event_Type": "Economic",
        "Country_Involved": "Gambia",
        "Description": "The Economic Advisor of Gambia signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-09-18",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Trade Minister of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-10-15",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The Military Advisor of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-09-07",
        "Event_Type": "Economic",
        "Country_Involved": "Ivory Coast",
        "Description": "The Business Delegation of Ivory Coast signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-02-27",
        "Event_Type": "Military",
        "Country_Involved": "Egypt",
        "Description": "The Chief of Staff of Egypt held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-06-21",
        "Event_Type": "Health",
        "Country_Involved": "Eritrea",
        "Description": "The Health Advisor of Eritrea collaborated with Russian health officials on initiatives to combat infectious diseases."
    },
    {
        "Date": "2022-04-15",
        "Event_Type": "Society",
        "Country_Involved": "Uganda",
        "Description": "A NGO Leader from Uganda engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2023-06-22",
        "Event_Type": "Military",
        "Country_Involved": "Morocco",
        "Description": "The Military Advisor of Morocco held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-03-17",
        "Event_Type": "Military",
        "Country_Involved": "Mozambique",
        "Description": "The Chief of Staff of Mozambique held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-02-24",
        "Event_Type": "Political",
        "Country_Involved": "Ethiopia",
        "Description": "The Ambassador of Ethiopia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-02-10",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-01-09",
        "Event_Type": "Political",
        "Country_Involved": "Benin",
        "Description": "The Ambassador of Benin met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-08-29",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Defense Minister of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-06-25",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Military Advisor of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-05-15",
        "Event_Type": "Economic",
        "Country_Involved": "Mozambique",
        "Description": "The Finance Minister of Mozambique signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2023-12-01",
        "Event_Type": "Political",
        "Country_Involved": "Morocco",
        "Description": "The Prime Minister of Morocco met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2022-11-23",
        "Event_Type": "Military",
        "Country_Involved": "Uganda",
        "Description": "The General of Uganda held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-01-05",
        "Event_Type": "Political",
        "Country_Involved": "Somalia",
        "Description": "The Ambassador of Somalia met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-07-08",
        "Event_Type": "Military",
        "Country_Involved": "Cameroon",
        "Description": "The Military Advisor of Cameroon held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-11-18",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-05-29",
        "Event_Type": "Society",
        "Country_Involved": "Botswana",
        "Description": "A Civil Society Representative from Botswana engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2022-01-02",
        "Event_Type": "Economic",
        "Country_Involved": "South Africa",
        "Description": "The Finance Minister of South Africa signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-08-05",
        "Event_Type": "Political",
        "Country_Involved": "Egypt",
        "Description": "The President of Egypt met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2023-10-13",
        "Event_Type": "Military",
        "Country_Involved": "Zambia",
        "Description": "The Military Advisor of Zambia held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-03-02",
        "Event_Type": "Economic",
        "Country_Involved": "Sao Tome and Principe",
        "Description": "The Finance Minister of Sao Tome and Principe signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-12-30",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The General of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2021-01-31",
        "Event_Type": "Economic",
        "Country_Involved": "Cabo Verde",
        "Description": "The Finance Minister of Cabo Verde signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2021-06-14",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Chief of Staff of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2024-02-24",
        "Event_Type": "Economic",
        "Country_Involved": "Mauritius",
        "Description": "The Economic Advisor of Mauritius signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2024-03-24",
        "Event_Type": "Economic",
        "Country_Involved": "Morocco",
        "Description": "The Economic Advisor of Morocco signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-12-14",
        "Event_Type": "Military",
        "Country_Involved": "Ghana",
        "Description": "The Chief of Staff of Ghana held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2023-12-11",
        "Event_Type": "Military",
        "Country_Involved": "Benin",
        "Description": "The General of Benin held talks with Russian military officials regarding joint military exercises and defense collaboration."
    },
    {
        "Date": "2022-09-04",
        "Event_Type": "Society",
        "Country_Involved": "Mozambique",
        "Description": "A NGO Leader from Mozambique engaged with Russian civil society groups to promote cultural exchange and social development."
    },
    {
        "Date": "2021-03-03",
        "Event_Type": "Political",
        "Country_Involved": "Senegal",
        "Description": "The Ambassador of Senegal met with Russian counterparts to discuss bilateral relations and political cooperation."
    },
    {
        "Date": "2021-02-06",
        "Event_Type": "Economic",
        "Country_Involved": "Nigeria",
        "Description": "The Business Delegation of Nigeria signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    },
    {
        "Date": "2022-12-21",
        "Event_Type": "Economic",
        "Country_Involved": "Ghana",
        "Description": "The Business Delegation of Ghana signed a trade agreement with Russia to boost economic ties and enhance bilateral trade."
    }
]